/* =========================================================================
   Trabajo Práctico Integrador - Bases de Datos Aplicadas
   Grupo N°: 13
   Comisión: 2900
   Fecha de Entrega: 17/06/2025
   Materia: Bases de Datos Aplicadas
   Alumnos: Vignardel Francisco 45778667
            De Titto Lucia 46501934
 ========================================================================= */
USE COM2900G13;
GO

/*_____________________________________________________________________
  ______________________ RegistrarCobranza ____________________________
  _____________________________________________________________________*/


/*_____________________________________________________________________
  ________________ HabilitarDebitoAutomatico __________________________
  _____________________________________________________________________*/

/*_____________________________________________________________________
  ________________ DeshabilitarDebitoAutomatico _______________________
  _____________________________________________________________________*/


/*_____________________________________________________________________
  ___________________ RegistrarPagoCuenta _____________________________
  _____________________________________________________________________*/


/*_____________________________________________________________________
  ____________________ GenerarReembolso _______________________________
  _____________________________________________________________________*/


/*_____________________________________________________________________
  ________________ RegistrarReintegroLluvia ___________________________
  _____________________________________________________________________*/

-- ✅ PRUEBA 1: Registrar reintegro por lluvia válido
EXEC cobranzas.GenerarReintegroPorLluvia
    @mes = '06',
    @año = '2024',
    @path = 'C:\Users\ldeti\Desktop\College\BDA\TP BDA\Com2900G13\ETL\open-meteo-buenosaires_2024.csv';
GO

SELECT * FROM cobranzas.NotaDeCredito;

-- ❌ PRUEBA 2: Registrar reintegro con fecha futura inválida
EXEC cobranzas.GenerarReintegroPorLluvia
    @mes = '05',
    @año = '2000',
    @path = 'C:\Users\ldeti\Desktop\College\BDA\TP BDA\Com2900G13\ETL\open-meteo-buenosaires_2024.csv';
GO
